000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КодыТоваровSKU/КодыТоваровSKU.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КодыТоваровSKU</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>SKU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КодыТоваровSKU/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;            
	
	Если Параметры.Свойство("Номенклатура") Тогда  
		Номенклатура = Параметры.Номенклатура; 
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Номенклатура", Параметры.Номенклатура);
		Элементы.ФормаСоздатьКодыSKU.Доступность = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("SKUУстанавливаетсяВГлавномУзлеРИБ");
		Если НЕ Элементы.ФормаСоздатьКодыSKU.Доступность Тогда
			ЭтотОбъект.Команды.СоздатьКодыSKU.Подсказка = НСтр("ru = 'Cоздание SKU в правилах обмена с оборудованием Offline'");
			Элементы.Список.ТолькоПросмотр = Истина;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьАвтоматическиКодыSKU()
	РегистрыСведений.КодыТоваровSKU.ВыполнитьПроверкуSKU(Номенклатура);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоздатьКодыSKU(Команда)
	ЗаполнитьАвтоматическиКодыSKU();
	ОбновитьИнтерфейс();
КонецПроцедуры
